OrgFiles/emacsconf.org
#+Title: Emacs US Config
#+PROPERTY: header-args:emacs-lisp :tangle ~/Projects/emacsone/init.el


* Init
#+BEGIN_SRC emacs-lisp
  (fset 'encode-utf-8
   (kmacro-lambda-form [?\M-x ?r ?e ?v ?e ?r ?t ?- ?b ?u ?f ?f ?e ?r ?- ?w ?i ?t ?h ?- ?c ?o ?d tab return ?u ?t ?f ?- ?8 return ?y ?e ?s return] 0 "%d"))
(global-set-key (kbd "C-c x e") 'encode-utf-8)
#+END_SRC

#+RESULTS:
: encode-utf-8


* Package Setup
#+begin_src emacs-lisp
  (require 'package)



  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ;;("org" . "https://orgmode.org/elpa/")
                           ("gnu" . "https://elpa.gnu.org/packages/")
                           ("nongnu" . "https://elpa.nongnu.org/nongnu/")

                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (assq-delete-all 'org package--builtins)
  (assq-delete-all 'org package--builtin-versions)
  (unless package-archive-contents
   (package-refresh-contents))

                                          ; Initialize use-package on non-Linux platforms

  (unless (package-installed-p 'use-package)
     (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)



#+end_src

#+RESULTS:
: t

* Mail with mu4e
** Config
#+BEGIN_SRC emacs-lisp
(use-package mu4e
   :ensure nil
   ;; :load-path "/usr/share/emacs/site-lisp/mu4e/"
   :config
   ;; this si set to t to avoid mail syncing issues
   (setq mu4e-change-filenames-when-moving t)
   ;; refresh mail using isync every 10 minutes
   (setq mu4e-update-interval (* 10 60))
   (setq mu4e-get-mail-command "mbsync -a")
   (setq mu4e-maildir "~/Mail")

   (setq mu4e-drafts-folder "/'[Gmail]'.Drafts")
   (setq mu4e-sent-folder "/[Gmail].Sent Mail")
   (setq mu4e-refile-folder "/[Gmail].All Mail")
   (setq mu4e-trash-folder "/[Gmail].Trash")

   (setq mu4e-maildir-shortcuts
   '(("/Inbox"                   . ?i)
     ("/[Gmail].Sent Mail"       . ?s)
     ("/[Gmail].Trash"           . ?t)
     ("/[Gmail].Drafts"          . ?d)
     ("/[Gmail].All Mail"        . ?a))))
   
#+END_SRC

#+RESULTS:
: t

#+RESULTS:mu
: t
** Hotkeys
| Key | Command                             | Description                                    |
| --  | -------------------                 | ---------------------------------------------- |
|     | *Movement*                            |                                                |
|     | ---                                 |                                                |
| n   | next-line                           | moves to next line                             |
| p   | prev-line                           | moves to prev line                             |
| [   | mu4e-headers-prev-unread            | moves to prev unread message                   |
| ]   | mu4e-headers-next-unread            | moves to next unread message                   |
| j   | mu4e-headers-jump-to-mail-dir       | Jump to another mail directory                 |
|     |                                     |                                                |
|     | *Toggles*                             |                                                |
| P   | mu4e-headers-toggle-threading       | Toggles threaded message display               |
| W   | mu4e-headers-toggle-include-related | Toggles related message display                |
|     |                                     |                                                |
|     | *Marking*                             |                                                |
| d   | mu4e-headers-mark-for-trash         | Marks message for deletion                     |
| m   | mu4e-headers-mark-for-move          | Marks message for move to folder               |
| +   | mu4e-headers-mark-for-flag          | Marks message for flagging                     |
| -   | mu4e-headers-mark-for-unflag        | Marks smessage for unflagging                  |
| %   | mu4e-headers-mark-for-pattern       | Marks based on a regex pattern                 |
| u   | mu4e-headers-mark-for-unmark        | Removes mark for message                       |
| U   | mu4e-mark-unmark-all                | Removes mark for all marks in view             |
| x   | mu4e-mark-execute-all               | Execute all marks in view                      |
|     |                                     |                                                |
|     | *Searching*                           |                                                |
| s   | mu4e-headers-search                 | Search all e-mails                             |
| S   | mu4e-headers-search-edit            | Edit current search (useful!!)                 |
| /   | mu4e-headers-search-narrow          | Narrow down the current results                |
| b   | mu4e-headers-search-bookmark        | Select a bookmark to search with               |
| B   | mu4e-headers-search-bookmark-edit   | Edit bookmark before search                    |
| g   | mu4e-rerun-search                   | Rerun current search                           |


* Basic UI Config
#+begin_src emacs-lisp
    (setq inhibit-startup-message t)

    (scroll-bar-mode -1) ;Disable visible scrollbar
    (tool-bar-mode -1)   ;DIsable toolbar
    (tooltip-mode -1)    ;disable tooltips11
    (set-fringe-mode 10) ;give some breathing room

    (menu-bar-mode -1)   ;disable menu bar

  ; setup the visible bell

    (setq visible-bell t)

  ;set font

    (set-face-attribute 'default nil :font "Fira Code Retina" :height 140)
  ; load theme note this passes an object denoted by a leading `


    (load-theme 'tango-dark)


    (desktop-save-mode 1)
    












#+end_src

#+RESULTS:
: t

** Themes
#+begin_src emacs-lisp
                                          ;set doom themes
    (use-package doom-themes
      :ensure t
      :config
      ;;(load-theme 'doom-gruvbox t))
      (load-theme 'doom-sourcerer t))
    
    (use-package doom-modeline
      :ensure t
      :init (doom-modeline-mode 1)
      :config 
      (setq doom-modeline-height 15))

#+end_src

#+RESULTS:
: t

** DONE Transparency
CLOSED: [2022-06-01 Wed 13:18]
#+BEGIN_SRC emacs-lisp
  (set-frame-parameter (selected-frame) 'alpha '(85 . 50))
  (add-to-list 'default-frame-alist '(alpha . (85 . 50)))

  (defun toggle-transparency ()
    (interactive)
    (let ((alpha (frame-parameter nil 'alpha)))
      (set-frame-parameter
       nil 'alpha
       (if (eql (cond ((numberp alpha) alpha)
                      ((numberp (cdr alpha)) (cdr alpha))
                      ;; Also handle undocumented (<active> <inactive>) form.
                      ((numberp (cadr alpha)) (cadr alpha)))
                100)
           '(85 . 50) '(100 . 100)))))
  (global-set-key (kbd "C-c x t") 'toggle-transparency)

#+END_SRC

#+RESULTS:

* Emacs Usability
** Helpful
#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

#+RESULTS:
: helpful-key

** Whichkey
#+begin_src emacs-lisp
(use-package which-key
  :init (which-key-mode)
  :diminish (which-key-mode)
  :config
  (setq which-key-idle-delay 1))

#+end_src

#+RESULTS:
: t

** Completion
#+begin_src emacs-lisp
  
;;           (use-package counsel
;;             :bind (("M-x" . counsel-M-x)
;;                    ("C-x b" . counsel-ibuffer)


;; story)))

  ;;        (use-package ivy-richt
    ;;        :init
      ;;      (ivy-rich-mode 1))

          (use-package vertico
            :ensure t
            :custom
            (vertico-cycle t)
            :init
            (vertico-mode))
  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :ensure t
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))



#+end_src

#+RESULTS:

** Yas Mode
#+BEGIN_SRC emacs-lisp

(yas-global-mode 1)
#+END_SRC

#+RESULTS:
: t



* Window Control
#+BEGIN_SRC emacs-lisp
(use-package ace-window)



(custom-set-faces
 '(aw-leading-char-face
   ((t (:inherit ace-jump-face-foreground :height 3.0)))))



(global-set-key (kbd "C-M-]") 'avy-goto-word-or-subword-1)
;; unbund c-] from abort-recursive-edit
(global-set-key (kbd "C-+") 'smartscan-symbol-go-backward)
(global-set-key (kbd "C-=") 'smartscan-symbol-go-forward)
(global-set-key (kbd "M-RET") 'counsel-ibuffer)



#+END_SRC

#+RESULTS:
: counsel-ibuffer

#+RESULTS:[]
: counsel-ibuffer

* Org Config Setup
** initial package setup
#+begin_src emacs-lisp
  ;;;;; Org mode setup ;;;;;

                                          ;require tempo

  (defun org-mode-setup()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1))


  (use-package org
    :hook (org-mode . org-mode-setup)
    :config
    (setq org-agenda-files
          '("~/Orgfiles/tasks.org"
            "~/Orgfiles/habits.org"))

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t)
    (setq org-capture-babel-evaluate t)
    (setq org-startup-with-inline-images t)

                                          ; org capture

    (setq org-capture-templates
          '(("t" "Tasks / Projects")
            ("tt" "Task" entry (file+olp "~/Orgfiles/tasks.org" "Inbox")
             "* TODO %?\n %U\n %a\n %i" :empty-lines 1)
            ("ts" "Clockked Entry Subtask" entry (clock)
             "* TODO %?\n %U\n %a\n %i" :empty-lines 1)

            ("j" "Journal Entries")
            ("jj" "Journal" entry
             (file+olp+datetree "~/Orgfiles/journal.org")
             "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
             ;;
             :clock-in :clock-resume
             :empty-lines 1)
            ("jm" "Meeting" entry
             (file+olp+datetree "~/Orgfiles/journal.org")
             "* %<%I:%M %P> - %a :meetings:\n\n%?\n\n"
             :clock-in :clock-resume
             :empty-lines 1)

            ("w" "Workflows")
            ("we" "Checking Email" entry (file+olp+datetree "~/Orgfiles/journal.org")
             "* Checking Email :email:\n\n%?" :clockin :clock-resume :empty-lines 1)

            ("m" "Metrics Capture")

            ("mw" "Weight" table-line (file+headline "~/Orgfiles/metrics.org" "Weight")
             "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t))))

                                          ; hotkey bindings
    (define-key global-map (kbd "C-c o")
      (lambda () (interactive) (org-capture)))

    (define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj")))

    (define-key global-map (kbd "C-c t")
    (lambda () (interactive) (org-capture nil "tt")))

    (global-set-key (kbd "C-c a") 'org-agenda)


                                          ; refile targets


    (setq org-refile-targets
          '(("archive.org" :maxlevel . 1)
            ("tasks.org" :maxlevel . 1)))
                                          ; load org habits
    (require 'org-habit)
     (add-to-list 'org-modules 'org-habit)
     (setq org-habit-graph-column 60)



  ;;;;; end org mode setup ;;;;; 

#+end_src

#+RESULTS:
: 60

