OrgFiles/emacsconf.org
** Font Configuration
#+begin_src emacs-lisp
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))
                                            ; keep a few things fixed pitch as they should be for line ups

  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  ;  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

#+end_src
** bullets and dashes
#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))


					;replace dashes with dots

(font-lock-add-keywords 'org-mode
                         '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))			   

#+end_src
** Structure Templates
#+begin_src emacs-lisp
    ;; This is needed as of Org 9.2
 ;  (require 'org-tempo)
  ;  (with-eval-after-load 'org-tempo
        (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
       (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")) 
        (add-to-list 'org-structure-template-alist '("py" . "src python"))


#+end_src
** Language Setup
#+begin_src emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp .t )
     (js .t)
     (python .t)))

#+end_src

#+RESULTS:

** Auto-Tangle Config Files
#+begin_src emacs-lisp
;;auto tangle my emacs config file
  (defun emacsone/org-babel-tangle-config()
    (when (string-equal (buffer-file-name)
		        (expand-file-name "~/Projects/emacsone/OrgFiles/emacsconf.org"))
      ;; dynamic scoping
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))
    (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'emacsone/org-babel-tangle-config)))
#+end_src

#+RESULTS:
| (lambda nil (add-hook 'after-save-hook #'emacsone/org-babel-tangle-config)) | (closure (org--rds reftex-docstruct-symbol org-element-greater-elements visual-fill-column-width org-clock-history org-agenda-current-date org-with-time org-defdecode org-def org-read-date-inactive org-ans2 org-ans1 org-columns-current-fmt-compiled org-clock-current-task org-clock-effort org-agenda-skip-function org-agenda-skip-comment-trees org-agenda-archives-mode org-end-time-was-given org-time-was-given org-log-note-extra org-log-note-purpose org-log-post-message org-last-inserted-timestamp org-last-changed-timestamp org-entry-property-inherited-from org-blocked-by-checkboxes org-state org-agenda-headline-snapshot-before-repeat org-agenda-buffer-name org-agenda-start-on-weekday org-agenda-buffer-tmp-name org-priority-regexp org-mode-abbrev-table org-mode-syntax-table buffer-face-mode-face org-tbl-menu org-org-menu org-struct-menu org-entities org-last-state org-id-track-globally org-clock-start-time texmathp-why remember-data-file org-agenda-tags-todo-honor-ignore-options iswitchb-temp-buflist calc-embedded-open-mode calc-embedded-open-formula calc-embedded-close-formula align-mode-rules-list org-emphasis-alist org-emphasis-regexp-components org-export-registered-backends org-modules crm-separator org-babel-load-languages org-id-overriding-file-name org-indent-indentation-per-level org-element--timestamp-regexp org-element-paragraph-separate org-inlinetask-min-level t) nil (add-hook 'change-major-mode-hook 'org-show-all 'append 'local)) | (closure (org-src-window-setup *this* org-babel-confirm-evaluate-answer-no org-babel-tangle-uncomment-comments org-src-preserve-indentation org-src-lang-modes org-edit-src-content-indentation org-babel-library-of-babel t) nil (add-hook 'change-major-mode-hook #'org-babel-show-result-all 'append 'local)) | org-babel-result-hide-spec | org-babel-hide-all-hashes |

** Visual Fill Mode
#+begin_src emacs-lisp
    (defun org-mode-visual-fill()
      (setq visual-fill-column-width 150 visual-fill-column-center-text t)
      (visual-fill-column-mode 1))


    (use-package visual-fill-column
      :hook (org-mode . org-mode-visual-fill)) 

#+end_src
** Pomodoro
#+BEGIN_SRC emacs-lisp 

(setq org-clock-sound "~/Downloads/cheer.wav")
#+END_SRC

#+RESULTS:
: ~/Downloads/cheer.wav

* Org-Roam Setup
#+BEGIN_SRC emacs-lisp


          (use-package org-roam
            :ensure t
            :init
            (setq org-roam-v2-act t)
            :custom
            (org-roam-directory "~/RoamNotes")
            (org-roam-completion-everywhere t)
            ( org-agenda-todo-list-sublevels nil)        

            :bind
            (("C-c n l" . org-roam-buffer-toggle)
             ("C-c n f" . org-roam-node-find)
             ("C-c n i" . org-roam-node-insert)
             ("C-c n i" . org-id-get-create)
             ("C-c n a" . org-roam-alias-add)
             ("C-c n t" . org-roam-tag-add)
             ("C-c n r" . org-roam-ref-add)
             ("C-c n x a" . org-roam-alias-remove)
             ("C-c n x r" . org-roam-ref-remove)
             ("C-c n x t" . org-roam-tag-remove)

             ("C-c n I" . org-roam-node-insert-immediate)
             :map org-mode-map
             ("C-c n b" . org-mark-ring-goto)
             :map org-roam-dailies-map
             ("Y" . org-roam-dailies-capture-yesterday)
             ("T" . org-roam-dailies-capture-tomorrow))

             :bind-keymap
             ("C-c n d" . org-roam-dailies-map)
             :config
             (require 'org-roam-dailies)
             (org-roam-db-autosync-mode))

      ;;  Bind this to C-c n I
        (defun org-roam-node-insert-immediate (arg &rest args)
          (interactive "P")
          (let ((args (cons arg args))
                (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                          '(:immediate-finish t)))))
            (apply #'org-roam-node-insert args)))  



            (with-eval-after-load "org-roam" 
              (setq org-roam-capture-templates
                    '(("d" "default" plain
                       "%?"
                       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
                       :unnarrowed t)
                      ;; programming language
                      ("l" "programming language" plain
                       "* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
                       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
                       :unnarrowed t)
                      ;; programming insight - javascript
                      ("i" "Programming Insights" plain
                      "* Problem\n\n* Insight:\n\n* Solution:\n\n* Refactoring:\n\n* Fig1:\n\n#+BEGIN_SRC javascript\n\n\n#+END_SRC"
                       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\n")
                       :unnarrowed t)
                      ("b" "book notes" plain
                       "\n* Source\n\nAuthor: %^{Author}\nTitle: ${title}\nYear: %^{Year}\n\n* Summary\n\n%?"
                       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+date: %U\nest")
                       :unnarrowed t))))


  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:15}" 'face 'org-tag)))

            (use-package org-roam-ui
              :bind ("s-r" . org-roam-ui-open))


#+END_SRC

#+RESULTS:
: org-roam-ui-open

* Ledger-Mode
#+BEGIN_SRC emacs-lisp
  (use-package ledger-mode
    :ensure t
    :init
    (setq ledger-clear-whole-transactions 1)
    :bind (
           :map ledger-mode-map
            ("s-n" . ledger-navigate-next-uncleared)
            ("s-p" . ledger-navigate-previous-uncleared))
    :mode "\\.dat\\'")

    (setq ledger-reports
          '(("bal"            "%(binary) -f %(ledger-file) bal")
            ("bal this month" "%(binary) -f %(ledger-file) bal -p %(month) -S amount")
            ("bal this year"  "%(binary) -f %(ledger-file) bal -p 'this year'")
            ("net worth"      "%(binary) -f %(ledger-file) bal Assets Liabilities")
            ("account"        "%(binary) -f %(ledger-file) reg %(account)")))



#+END_SRC

#+RESULTS:
| bal            | %(binary) -f %(ledger-file) bal                       |
| bal this month | %(binary) -f %(ledger-file) bal -p %(month) -S amount |
| bal this year  | %(binary) -f %(ledger-file) bal -p 'this year'        |
| net worth      | %(binary) -f %(ledger-file) bal Assets Liabilities    |
| account        | %(binary) -f %(ledger-file) reg %(account)            |

* IDE Setup
** To add

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :bind (("s-m m" . magit-status)
           ("s-m j" . magit-dispatch)
           ("s-m k" . magit-file-dispatch)
           ("s-m l" . magit-log-buffer-file)
           ("s-m b" . magit-blame))
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
  (setq magit-clone-default-directory "~/Projects/")

  ;; Bindings



#+end_src

#+RESULTS:
: ~/Projects/

** Git Gutter
#+BEGIN_SRC emacs-lisp
  (use-package git-gutter
    :hook (prog-mode . git-gutter-mode)
    :config
    (setq git-gutter:update-interval 0.02))
  (use-package git-gutter-fringe
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

#+END_SRC

#+RESULTS:
: t

** Forge
#+begin_src emacs-lisp
(use-package forge)
#+end_src

** Git from Clipboard
#+begin_src emacs-lisp

(defun ar/git-clone-clipboard-url ()
  "Clone git URL in clipboard asynchronously and open in dired when finished."
  (interactive)
  (cl-assert (string-match-p "^\\(http\\|https\\|ssh\\)://" (current-kill 0)) nil "No URL in clipboard")
  (let* ((url (current-kill 0))
         (download-dir (expand-file-name "~/Downloads/"))
         (project-dir (concat (file-name-as-directory download-dir)
                              (file-name-base url)))
         (default-directory download-dir)
         (command (format "git clone %s" url))
         (buffer (generate-new-buffer (format "*%s*" command)))
         (proc))
    (when (file-exists-p project-dir)
      (if (y-or-n-p (format "%s exists. delete?" (file-name-base url)))
          (delete-directory project-dir t)
        (user-error "Bailed")))
    (switch-to-buffer buffer)
    (setq proc (start-process-shell-command (nth 0 (split-string command)) buffer command))
    (with-current-buffer buffer
      (setq default-directory download-dir)
      (shell-command-save-pos-or-erase)
      (require 'shell)
      (shell-mode)
      (view-mode +1))
    (set-process-sentinel proc (lambda (process state)
                                 (let ((output (with-current-buffer (process-buffer process)
                                                 (buffer-string))))
                                   (kill-buffer (process-buffer process))
                                   (if (= (process-exit-status process) 0)
                                       (progn
                                         (message "finished: %s" command)
                                         (dired project-dir))
                                     (user-error (format "%s\n%s" command output))))))
    (set-process-filter proc #'comintoutput-filter)))
#+end_src



** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects/Code")
    (setq projectile-project-search-path '("~/Projects/Code")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :config (counsel-projectile-mode))

#+end_src
** Rainbow Deliminators
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

#+RESULTS:
| rainbow-delimiters-mode |

** Electric Pair mode
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'electric-pair-mode)
(add-hook 'prog-mode-hook 'electric-indent-mode)
(global-set-key (kbd "C-c s (") 'electric-pair-mode)


#+END_SRC

#+RESULTS:
| electric-indent-mode | electric-pair-mode | my-display-numbers-hook | rainbow-delimiters-mode |
** Line Numbers
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)

(defun my-display-numbers-hook ()
  (display-line-numbers-mode t)
  )
(add-hook 'prog-mode-hook 'my-display-numbers-hook)
(add-hook 'text-mode-hook 'my-display-numbers-hook)
(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

#+RESULTS:
** subword mode
#+BEGIN_SRC emacs-lisp
(add-hook 'prog-mode-hook 'subword-mode)
#+END_SRC

#+RESULTS:
| subword-mode | my-display-numbers-hook | electric-indent-mode | electric-pair-mode | rainbow-delimiters-mode | git-gutter-mode |

** Commenting
#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :bind ("M-;" . evilnc-comment-or-uncomment-lines))
#+end_src

** Mini-map
#+BEGIN_SRC emacs-lisp
(use-package minimap)

(setq minimap-window-location 1)

(global-set-key (kbd "C-c s m")  'minimap-mode)
#+END_SRC

#+RESULTS:
: minimap-mode

** Languages
*** HTML & CSS
Some possible html modes to look into:
http://xahlee.info/emacs/emacs/emacs_html.html
http://xahlee.info/emacs/emacs/xah-css-mode.html
**** web-mode
#+BEGIN_SRC emacs-lisp
(use-package web-mode)
(setq web-mode-enable-current-column-highlight t)
(setq web-mode-enable-current-element-highlight t)
; hook into web mode for file types
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
;;using rsjx mode
;;(add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode))
;(add-to-list 'auto-mode-alist '("\\.css?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.xml\\'" . web-mode))
;; using rsjx mode
;;(add-to-list 'auto-mode-alist '("\\.jsx\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.ts\\'" . web-mode))

; set company completions vocab to css and html

(setq web-mode-enable-engine-detection t)

#+END_SRC

#+RESULTS:
: t
