OrgFiles/emacsconf.org
**** TODO emmet-mode
#+BEGIN_SRC emacs-lisp
(use-package emmet-mode
:bind
("M-n" . emmet-next-edit-point)
("M-p" . emmet-prev-edit-point))
; use emmet in all web-mode docs
(add-hook 'web-mode-hook 'emmet-mode)
(add-hook 'css-mode-hook 'emmet-mode)

; enable mode switching between css and java
(add-hook 'web-mode-before-auto-complete-hooks
    '(lambda ()
     (let ((web-mode-cur-language
  	    (web-mode-language-at-pos)))
               (if (string= web-mode-cur-language "php")
    	   (yas-activate-extra-mode 'php-mode)
      	 (yas-deactivate-extra-mode 'php-mode))
               (if (string= web-mode-cur-language "css")
    	   (setq emmet-use-css-transform t)
      	 (setq emmet-use-css-transform nil)))))




#+END_SRC

#+RESULTS:
| lambda | nil | (let ((web-mode-cur-language (web-mode-language-at-pos))) (if (string= web-mode-cur-language php) (yas-activate-extra-mode (quote php-mode)) (yas-deactivate-extra-mode (quote php-mode))) (if (string= web-mode-cur-language css) (setq emmet-use-css-transform t) (setq emmet-use-css-transform nil))) |
**** css-mode
#+BEGIN_SRC emacs-lisp

#+END_SRC
*** Language Server
#+begin_src emacs-lisp
  ; breadcrumb setup

  (defun lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

    (use-package lsp-mode
      :commands (lsp lsp-deffered)
      :hook (lsp-mode . lsp-mode-setup)
      :init
      (setq lsp-keymap-prefix "C-c l")
      :config
      (lsp-enable-which-key-integration t))
    ; turn on lsp ui

    (use-package lsp-ui
      :after lsp
      :hook (lsp-mode . lsp-ui-mode)
      :config
      (setq lsp-ui-doc-position 'bottom))

    (use-package lsp-treemacs
      :after lsp)
    (setq treemacs-select-when-already-in-treemacs 'close)




#+end_src

#+RESULTS:
: close
*** TypeScript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+end_src
*** Javascript
Following setup from here: https://www.chadstovern.com/javascript-in-emacs-revisited/
#+BEGIN_SRC emacs-lisp
  (use-package rjsx-mode
    :mode ("\\.js\\'"
           "\\.jsx\\'")
    :config
    (setq js2-mode-show-parse-errors nil
          js2-mode-show-strict-warnings nil
          js2-basic-offset 2
          js-indent-level 2)
    ;; (setq-local flycheck-disabled-checkers (cl-union flycheck-disabled-checkers
    ;;                                                  '(javascript-jshint))) ; jshint doesn't work for JSX
     (electric-pair-mode 1))

  (use-package add-node-modules-path
    :defer t
    :hook (((js2-mode rjsx-mode) . add-node-modules-path)))

  ;; prettify

  (use-package prettier-js
    :defer t
    :diminish prettier-js-mode
    :hook (((js2-mode rjsx-mode) . prettier-js-mode)))

  ;; setup lsp mode
  (use-package lsp-mode
    :defer t
    :diminish lsp-mode
    :hook (((js2-mode rjsx-mode) . lsp))
    :commands lsp
    :config
    (setq lsp-auto-configure t
          lsp-auto-guess-root t
          ;; don't set flymake or lsp-ui so the default linter doesn't get trampled
          lsp-diagnostic-package :none))



  (use-package lsp-ui
    :defer t
    :config
    (setq lsp-ui-sideline-enable t
          ;; disable flycheck setup so default linter isn't trampled
          lsp-ui-flycheck-enable nil
          lsp-ui-sideline-show-symbol nil
          lsp-ui-sideline-show-hover nil
          lsp-ui-sideline-show-code-actions nil
          lsp-ui-peek-enable nil
          lsp-ui-imenu-enable nil
          lsp-ui-doc-enable nil))


  (defun my-js-comint-keys ()
    "My Keys for sending to the js-comint repl"
    (interactive)
    (local-set-key (kbd "C-x C-e") 'js-send-last-sexp)
    (local-set-key (kbd"C-c b") 'js-send-buffer)
    (local-set-key (kbd"C-c r") 'js-send-region)
    (local-set-key (kbd"C-c C-r") 'js-send-region-and-go))




  (require 'js-comint)
  (setq inferior-js-program-command "node --interactive")
  (setenv "NODE_NO_READLINE" "1")
  (add-hook 'rjsx-mode-hook 'my-js-comint-keys)
  (add-hook 'rjsx-mode-hook 'emmet-mode)


  (with-eval-after-load 'flycheck
    (flycheck-add-next-checker 'javascript-eslint '(t . javascript-jscs)))





#+END_SRC

#+RESULTS:
*** Haxe
#+BEGIN_SRC emacs-lisp
;; This isn't really a package, it just provides a `haxe-mode' to work with
(use-package haxe-mode
  :mode ("\\.hx\\'" . haxe-mode)
  :no-require t
  :init
  (require 'js)
  (define-derived-mode haxe-mode js-mode "Haxe"
    "Haxe syntax highlighting mode. This is simply using js-mode for now."))

(use-package battle-haxe
  :hook (haxe-mode . battle-haxe-mode)
  :bind (("S-<f4>" . #'pop-global-mark) ;To get back after visiting a definition
         :map battle-haxe-mode-map
         ("<f5>" . #'battle-haxe-goto-definition)
         ("<f12>" . #'battle-haxe-helm-find-references))
  :custom
  (battle-haxe-yasnippet-completion-expansion t "Keep this if you want yasnippet to expand completions when it's available.")
  (battle-haxe-immediate-completion nil "Toggle this if you want to immediately trigger completion when typing '.' and other relevant prefixes."))
#+END_SRC

#+RESULTS:

** Better Completions
#+begin_src emacs-lisp
      (use-package company
      :after lsp-mode
      :hook ((lsp-mode web-mode) . company-mode)
      :bind (:map company-active-map
                  ( "<tab>" . company-complete-selection))
      (:map lsp-mode-map
            ("<tab>" . company-indent-or-complete-common)) 
  )
      (setq company-minimum-prefix-length 2)



    (use-package company-web
  :after company)


  (defun my-web-mode-hook ()
    (set (make-local-variable 'company-backends) '(company-css company-web-html company-yasnippet company-files)))  

  (add-hook 'web-mode-hook 'my-web-mode-hook)

  ;; Company mode for yas
  (global-set-key (kbd "<C-tab>") 'company-yasnippet)
    ;  (use-ackage company-box
     ;   :hook (company-mode . company-box-mode))
#+end_src

#+RESULTS:
: company-yasnippet

** Debugging
Dap mode here: https://www.youtube.com/watch?v=0bilcQVSlbM

* Macros and rebind

** Dabbrev
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-=") 'dabbrev-expand
                  )
  (global-set-key (kbd "M-C-=") 'dabbrev-completion)
#+END_SRC
** next-tag - "C-x t" - Move inside the next tag set in web-mode
#+BEGIN_SRC emacs-lisp
    (defun next-tag()
      (interactive)
        (web-mode-element-next)
        (web-mode-tag-end))



    (global-set-key  (kbd "C-x t") 'next-tag)

  ;; timer controls
  (global-set-key (kbd "H-t t") 'org-timer-set-timer)
  (global-set-key (kbd "H-t s") 'org-timer-start)
  (global-set-key (kbd "H-t x") 'org-timer-stop)
  (global-set-key (kbd "H-t z") 'org-timer-pause-or-continue)


    ;; set ctrl z to undo
    (global-set-key (kbd "C-z") 'undo)

#+END_SRC

#+RESULTS:
: undo

#+RESULTS::
: next-tag
** Window Movement
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-+") 'other-window)
  (global-set-key (kbd "M-[") 'ace-window)
  (global-set-key (kbd "M-]") 'treemacs-select-window)
  (global-set-key (kbd "C-c s t") 'treemacs)
  (global-set-key (kbd "H-1") 'delete-other-windows)
  (global-set-key (kbd "H-2") 'split-window-below)
  (global-set-key (kbd "H-3") 'split-window-right)
#+END_SRC

#+RESULTS:
: split-window-right

** TODO Cursor Movement
#+BEGIN_SRC emacs-lisp
    (defun insert-line-above-and-go ()
      ;;insert a line above the current one and move the cursor there
      (interactive)
      (previous-line nil)
      (move-end-of-line nil)
      (electric-newline-and-maybe-indent)
      (indent-relative-first-indent-point))

    (global-set-key (kbd "M-o") 'insert-line-above-and-go)

    ;;
    ;

    ; ;

    ;; move C-j to C-; indent-new-comment-line
    (global-set-key (kbd "C-;") 'indent-new-comment-line)

    (global-set-key (kbd "H-]") 'xref-find-references)
    (global-set-key (kbd "H-[") 'xref-go-back)
    (global-set-key (kbd "H-g") 'goto-line)

    (defun wrap-sexp-backward-with-parenthesis()
      (interactive)
      (backward-sexp)
      (mark-sexp) 
      (insert-parentheses))

      (global-set-key (kbd "C-(") 'wrap-sexp-backward-with-parenthesis)


    (global-set-key (kbd "s-a") 'ace-jump-word-mode)


    (global-set-key (kbd "M-m")  (kmacro-lambda-form [?\C-u ?\C-x ?\C-x] 0 "%d"))



#+End_SRC

#+RESULTS:
| lambda | (&optional arg) | Keyboard macro. | (interactive p) | (kmacro-exec-ring-item '([21 24 24] 0 %d) arg) |
** Delete at cursor
#+BEGIN_SRC emacs-lisp
(defun kill-word-at-point()
  (interactive)
  (kill-word 1)
  (backward-kill-word 1))

  (global-set-key (kbd "M-DEL") 'kill-word-at-point)

(defun kill-line-at-point()
  (interactive)
  (back-to-indentation)
  (kill-line))
  
  (global-set-key (kbd "s-l") 'kill-line-at-point)


#+END_SRC

#+RESULTS:
: kill-line-at-point

#+-
**  Duplicate Lines
#+BEGIN_SRC emacs-lisp
  (defun duplicate-current-line()
    "Duplicates the entire line under point. Repetable with 'd' "
    (interactive)
    (back-to-indentation)
    (kill-line)
    (yank)
    (newline)
    (indent-for-tab-command)
    (yank)
    (set-temporary-overlay-map
      (let ((map (make-sparse-keymap)))
        (define-key map (kbd "d") 'duplicate-current-line)
        map)))

  (defun duplicate-line-up-to-point()
   "Duplicates a line from start of indentation up to point. May be repeated with single 'd' presses."
    (interactive)
    (set-mark-command nil)
    (back-to-indentation)
    (kill-ring-save (region-beginning) (region-end))
    (end-of-line)
    (newline)
  ;; example of single key repeat functionality
    (yank)
    (set-temporary-overlay-map
      (let ((map (make-sparse-keymap)))
        (define-key map (kbd "d") 'duplicate-line-up-to-point)
        map)))


  (global-set-key (kbd "H-s-d") 'duplicate-current-line
                  )
  (global-set-key (kbd "H-d") 'duplicate-line-up-to-point)









#+END_SRC

#+RESULTS:
: duplicate-line-up-to-point
** Register manipulation
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-,") 'point-to-register)
(global-set-key (kbd "C-.") 'jump-to-register)
(global-set-key (kbd "H-s") 'bookmark-set)
(global-set-key (kbd "H-j") 'bookmark-jump)



#+END_SRC

#+RESULTS:
: bookmark-jump
* dired
** Hotkeys to remember
- m: mark files
- u: umark files
- U: unmark all files
- % -> m: reg expession mark
- * : mark by type
- ( : expand or collapse details
- k : kill marked files ( will kill from view but not delete)
- g : reload buffer
- * t: invert marked files
- S : create sym link
** config
#+BEGIN_SRC emacs-lisp
; list directories first
(setq dired-listing-switches "-agho --group-directories-first")
(setq dired-dwim-target t)


#+END_SRC
#+RESULTS:
: t
** SIngle Dired Buffer
#+BEGIN_SRC emacs-lisp
(use-package dired-single)
#+END_SRC
** Icons
#+BEGIN_SRC emacs-lisp
(use-package all-the-icons-dired
:hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC

#+RESULTS:
| all-the-icons-dired-mode | dired-hide-dotfiles-mode | dired-hide-dotfiles | doom-modeline-set-project-modeline |
** Dired-Open
#+BEGIN_SRC emacs-lisp

;(use-package dired-open) look into this package if you end up needing it.

#+END_SRC
** Hide Dot Files
- hotkey: . (dot)
#+BEGIN_SRC emacs-lisp
(defun my-dired-mode-hook ()
  "My `dired' mode hook."
  ;; To hide dot-files by default
  (dired-hide-dotfiles-mode))

;; To toggle hiding
(define-key dired-mode-map "." #'dired-hide-dotfiles-mode)
(add-hook 'dired-mode-hook #'my-dired-mode-hook)

#+END_SRC

#+RESULTS:
| my-dired-mode-hook | all-the-icons-dired-mode | dired-hide-dotfiles-mode | dired-hide-dotfiles | doom-modeline-set-project-modeline |
* Dashboard
#+BEGIN_SRC emacs-lisp
(use-package dashboard
:ensure t
:config
(dashboard-setup-startup-hook))

#+END_SRC

#+RESULTS:
: t

* Testing
#+BEGIN_SRC emacs-lisp

  ;;set load path for person elisp
  (add-to-list 'load-path "~/.emacs.d/lisp")
  (global-set-key (kbd "C-M-i") 'indent-region)
  ;; load the package iy-go-to-char
  (load "iy-go-to-char")
  ;; rebind back-to-indentation to "M-i" NOTE this unbinds!! tab-to-tab-stop
  (global-set-key (kbd "M-i") 'back-to-indentation)
  ;; rebind "M-m" iy-go-to-char
  (global-set-key (kbd "s-n") 'iy-go-to-char)
  ;;unbind C-m from return  
  (global-set-key (kbd "s-h") 'iy-go-up-to-char)
  (global-set-key (kbd "s-b") 'iy-go-to-char-backward)
  (global-set-key (kbd "s-g") 'iy-go-up-to-char-backward)

  ;; Line to copy - start with a macro
  ;; eventually make this your first fully functional lisp
  (fset 'yank-and-add-line-numbers
        (kmacro-lambda-form [?\C-x ?r ?N ?\C-x ?\C-x ?÷ ?\C-z] 0 "%d"))
  (global-set-key (kbd "s-k") 'yank-and-add-line-numbers) 

  ;; insert todays date


  (fset 'agenda-fullscreen
        (kmacro-lambda-form [?\C-c ?a ?a ?\C-x ?1] 0 "%d"))

  (global-set-key (kbd "<f13>") 'agenda-fullscreen)
  (global-set-key (kbd "<f14>") 'browse-url-of-buffer)

  (require 'calfw-org)
  (global-set-key (kbd "H-a") 'avy-goto-char-timer)


#+END_SRC

#+RESULTS:
: avy-goto-char-timer

* Homebrew Harpoon
#+BEGIN_SRC emacs-lisp


  (defvar active-harpoon)
  (setq active-harpoon 102)

  (defun current-buffer-is-harpooned (marker)
    (and (eq (marker-buffer marker) (current-buffer))))  

  (defun harpoon-f ()
    (interactive)
    (if (current-buffer-is-harpooned (get-register active-harpoon)) (point-to-register active-harpoon))
    (jump-to-register 102)
    (setq active-harpoon 102))

  (defun set-harpoon-f ()
    (interactive)
    (point-to-register 102)
    (setq active-harpoon 102)    
    )

  (defun harpoon-d ()
    (interactive)
    (if (current-buffer-is-harpooned (get-register active-harpoon)) (point-to-register active-harpoon))
    (jump-to-register 100)
    (setq active-harpoon 100))

  (defun set-harpoon-d ()
    (interactive)
    (point-to-register 100)
    (setq active-harpoon 100)    
    )

  (defun harpoon-a ()
    (interactive)
    (if (current-buffer-is-harpooned (get-register active-harpoon)) (point-to-register active-harpoon))
    (jump-to-register 97)
    (setq active-harpoon 97))

  (defun set-harpoon-a ()
    (interactive)
    (point-to-register 97)
    (setq active-harpoon 97)    
    )

  (defun harpoon-s ()
    (interactive)
    (if (current-buffer-is-harpooned (get-register active-harpoon)) (point-to-register active-harpoon))
    (jump-to-register 115)
    (setq active-harpoon 115))

  (defun set-harpoon-s ()
    (interactive)
    (point-to-register 115)
    (setq active-harpoon 115)
    )

  (global-set-key (kbd "H-a") 'harpoon-a)
  (global-set-key (kbd "C-H-a") 'set-harpoon-a)
  (global-set-key (kbd "H-s") 'harpoon-s)
  (global-set-key (kbd "C-H-s") 'set-harpoon-s)
  (global-set-key (kbd "H-d") 'harpoon-d)
  (global-set-key (kbd "C-H-d") 'set-harpoon-d)
  (global-set-key (kbd "H-f") 'harpoon-f)
  (global-set-key (kbd "C-H-f") 'set-harpoon-f)

#+END_SRC

#+RESULTS:
: set-harpoon-f

#+RESULTS:
: set-harpoon-f

* Read Desktop
#+BEGIN_SRC emacs-lisp
      (desktop-read)
#+END_SRC

